Тансаг зэрэглэлийн YAMA брэндийг зах зээлд нэвтрүүллээ  
Пальто, пиджакны үлгэр суулт, оёдлын болон материалын чанарыг цоо шинэ технологийн дэвшилд хүргэх зорилгоор Японы Lapine компанитай хамтран  хамтран ажиллаж байна.
Бельгийн Брюссель болон Швейцарийн Женев хотод салбар дэлгүүрээ нээснээр, гадаад зах зээлд нийт 47 салбар дэлгүүртэй болов.
Будах үйлдвэрийг бүрэн автоматжуулж, ээрмэл утасны агуулахыг 2 дахин өргөтгөж, 50тн-ийн багтаамжтай болгов.
Нэхмэл болон  принтэт бүтээгдэхүүн үйлдвэрлэх хүчин чадлыг 2 дахин нэмэгдүүлэв.
Монголд анх удаа хамгийн нарийн утсаар ваксдаж нэхдэг технологийг нэвтрүүлэв
Сочи -2014 өвлийн олимпод оролцох баг тамирчдыг ивээн тэтгэлээ.
 
Сүлжих болон болон хялгас ялгах, самнах технологийг шинэчлэн, үйлдвэрлэлийн хэмжээнд нийт 5,3 тэрбум төгрөгийн хөрөнгө оруулалт хийв.
Сүлжмэлийн машины шинэ технологи болох Whole Garment буюу оёдолгүй сүлжмэл бүтээгдэхүүн сүлжих машинуудыг суурилуулав.
Gobi-Mongolian Organic Cashmere болон Хямдралын дэлгүүрийг шинээр нээв.
IFF-JFF БОЛОН Panorama, Фестиваль моды, Import Goods Fair зэрэг Япон, Герман, ОХУ, Солонгос, Хятад зэрэг улсуудад зохион байгуулагдсан олон улсын үзэсгэлэнд амжилтай оролцсон.
Европын сонгомол хээтэй Баракко загварын драпан оёмол бүтээгдэхүүнийг 5 төрлөөр үйлдвэрлэж, Шилдэг бүтээгдэхүүнээр шалгарав
 
 
Монгол ямааны ноолуурын үндсэн дөрвөн өнгийг цайруулж, будахгүйгээр байгалийн өнгөөр нь бэлэн бүтээгдэхүүн болгох Gobi-Mongolian Organic Cashmere брэндийг худалдаанд гаргалаа.
 
Gobi by Saverio Palatella 2012 оны Намар, Өвлийн 100% ноолууран шинэ коллекцио гаргав.
Тоног төхөөрөмжийн шинэтгэл, өргөтгөлд зориулж, 7,1 тэрбум төгрөгийн хөрөнгө оруулалт хийв
Монгол улсад 6 нэрийн барааны дэлгүүрийг шинээр нээв
Үйлдвэрлэлийн хүчин чадлаа 2 дахин нэмэгдүүлэн, шинээр 300-аад ажлын байрыг зарлалаа.
Монголын ноолуурын салбарт анх удаагаа Принт технологийг нэвтрүүлэн, ноолуур дээр зургийг барлан буулгадаг технологитой боллоо.
Японы Токио хотод өөрийн салбар дэлгүүрээ нээлээ.
Италийн “VVA Consulting Company”-тай хамтран ажиллах гэрээг байгууллаа.
 
Говь Үйлдвэрт техник, технологийн шинэчлэлтүүдийг үе шаттайгаар хийж, Итали, Япон, Швейцарийн тоног, төхөөрөмжүүд суурилууллаа
   
Говь үйлдвэрийн дэргэдэх Төв дэлгүүрийн барилгын дизайныг Японы алдарт архитекторч Сайко Кейчиро шинээр хийж, дэлгүүр зургадугаар сард нээлтээ хийлээ. 
 
Япон улсын Shima Seiki брэндийн өндөр хүчин чадал бүхий компьютерийн бүрэн удирдлагатай сүлжих SSG122SV маркийн машин, ээрэхийн үйлдвэрт Итали улсын Stalam болон 66-DD 14G Conti Complett брэндийн машинуудыг суурилуулан үйлдвэрлэлийн хүчин чадлаа өргөтгөв.
   
“Говь” үйлдвэрийн төрийн мэдлийн хувьцааг Олон улсын нээлттэй дуудлага худалдаагаар “ЭФ СИ АЙ” ХХК худалдан авав.
Герман улсын Stoll үйлдвэрийн компьютерийн удирдлага бүхий сүлжих машинаар өргөтгөл хийв.        
 
Утас будах технологи болон орчин үеийн компьютерийн системд холбогдсон сүлжих машинуудыг суурилуулав.
Будах үйлдвэрийн техник, технологидоо олон улсын чанарын ISO-1004 тэмдэгтийг нэвтрүүллээ.
   
Гадаад зах зээлээ өргөжүүлэн 30 гаруй оронтой түншийн харилцаа тогтоож, АНУ-ын зах зээлд анх удаа 45,000 ширхэг бүтээгдэхүүн нийлүүлэв.
 
Монголд анх удаа ноос ноолууран өргөн хөнжил, ноолууран давуу, драп, нарийн номерын ээрмэл утас үйлдвэрлэх “Говь-2″ үйлдвэрийг ашиглалтанд хүлээн авав.
   
 
Итали улсын технологи тоног төхөөрөмжөөр ээрмэл, нэхмэл, сүлжих үйлдвэрийн өргөтгөлийг хийж, 8.0 сая ам.долларын хөрөнгө оруулалт хийв.
Монгол улсад анх удаа олон улсын чанарын ISO-9001:2000 тэмдэгтийг нэвтрүүллээ.
   
 
Япон улсын Shima Seiki брэндийн компьютерийн удирдлагатай сүлжих машиныг суурилууллаа
ISO 9001  Чанарын удирдлагын тогтолцоог хэрэгжүүлж, №1 гэрчилгээг гардан авлаа.   
Олон улсын стандарт ISO-9000 тэмдэгтийг үе шаттайгаар нэвтрүүлж, олон улсын чанарын цом болон гэрчилгээг Монгол улсаас анх удаа авсан.
Говь комбинат улсын нийт чөлөөт валютын орлогын 70 хувийг дангаараа бүрдүүлж байв.
Биеийн тамирын заал, ажиллагсдын сувиллын газар, хүүхдийн цэцэрлэг,  152 айлын орон сууцыг ашиглалтанд оруулав.
Компьютерийн автомат удирдлага бүхий Япон улсын SET-092 сүлжих машиныг үйлдвэрт суурилуулав
  Япон улсын дээд сургуульд анхны оюутан Р.Жигжид, П.Ганхуяг нар суралцав.    
Говь” үйлдвэр үүд хаалгаа анх нээв.
Инженер, техникийн ажилтнуудын Япон улсад 78 инженер техникийн ажилтнуудыг 3 сарын хугацаагаар суралцуулав
Үйлдвэрийн барилгын ажил бүрэн дуусав.      
“Говь” үйлдвэрийн барилгын шавыг тавив
Улаанбаатар хотноо ямааны ноолуур, тэмээний ноос боловсруулах үйлдвэр байгуулах тухай Монгол-Японы Засгийн газрын хэлэлцээрийг байгуулав.
Монголд анх удаа ямааны ноолуур, тэмээний ноос